Revit 2027 API
ReferencePoint.GetHubId Method
Id of associated Hub.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetHubId()
Public Function GetHubId As ElementId
public:
ElementId^ GetHubId()
member GetHubId : unit -> ElementId
Return Value
ElementId
See Also
Reference
ReferencePoint Class
Autodesk.Revit.DB Namespace